# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
f_series = pd.Series(data=[np.random.randint(low=1, high=4) for i in range(100)])
s_series = pd.Series(data=[np.random.randint(low=1, high=3) for i in range(100)])
t_series = pd.Series(data=[np.random.randint(low=10000, high=30000) for i in range(100)])

### Step 3. Let's create a DataFrame by joinning the Series by column

In [7]:
df = pd.DataFrame(data={1: f_series, 2: s_series, 3:t_series})
df

    1  2      3
0   2  1  19985
1   1  1  15886
2   2  1  10641
3   1  1  23804
4   2  2  16844
.. .. ..    ...
95  2  2  29053
96  1  1  12936
97  3  2  18856
98  2  1  14537
99  1  2  13614

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [8]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       2       1            19985
1       1       1            15886
2       2       1            10641
3       1       1            23804
4       2       2            16844
..    ...     ...              ...
95      2       2            29053
96      1       1            12936
97      3       2            18856
98      2       1            14537
99      1       2            13614

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [11]:
bigcolumn = pd.concat([f_series,s_series,t_series])
bigcolumn

0         2
1         1
2         2
3         1
4         2
      ...
95    29053
96    12936
97    18856
98    14537
99    13614
Length: 300, dtype: int64

### Step 6. Oops, it seems it is going only until index 99. Is it true?

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [12]:
bigcolumn = pd.concat([f_series,s_series,t_series], ignore_index=True)
bigcolumn

0          2
1          1
2          2
3          1
4          2
       ...
295    29053
296    12936
297    18856
298    14537
299    13614
Length: 300, dtype: int64